In [2]:
import pandas, numpy

In [4]:
df1 = pandas.DataFrame({
    'key1' : ['a', 'a', 'b', 'b', 'a'],
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1': numpy.random.randn(5),
    'data2': numpy.random.randn(5)
})

In [6]:
grouped = df1['data1'].groupby(df1['key1'])
grouped

In [7]:
grouped.mean() # 그룹화된 데이터의 통계: 평균

key1
a   -0.320619
b   -0.110154
Name: data1, dtype: float64

In [8]:
df1

      data1     data2 key1 key2
0 -0.552193 -0.177470    a  one
1 -0.486440 -0.752776    a  two
2  0.895821 -1.280097    b  one
3 -1.116129 -0.661318    b  two
4  0.076775  0.662958    a  one

In [10]:
means = df1['data1'].groupby([df1['key1'], df1['key2']]).mean() # 복수 개의 column을 기준으로 grouping

In [11]:
means

key1  key2
a     one    -0.237709
      two    -0.486440
b     one     0.895821
      two    -1.116129
Name: data1, dtype: float64

In [12]:
means.unstack()
# Unstack, a.k.a. pivot, Series with MultiIndex to produce DataFrame.
# The level involved will automatically get sorted.

key2       one       two
key1
a    -0.237709 -0.486440
b     0.895821 -1.116129

In [17]:
means.unstack(0)

key1         a         b
key2
one  -0.237709  0.895821
two  -0.486440 -1.116129

In [18]:
means.unstack(1)

key2       one       two
key1
a    -0.237709 -0.486440
b     0.895821 -1.116129

In [19]:
df1.groupby('key1').sum()

         data1     data2
key1
a    -0.961858 -0.267288
b    -0.220308 -1.941415

In [20]:
df1.groupby(['key1', 'key2']).sum()

              data1     data2
key1 key2
a    one  -0.475418  0.485488
     two  -0.486440 -0.752776
b    one   0.895821 -1.280097
     two  -1.116129 -0.661318

In [21]:
grouped = df1.groupby('key1')

In [30]:
for name, group in grouped:
    print('group', name)
    print(group)

group a
      data1     data2 key1 key2
0 -0.552193 -0.177470    a  one
1 -0.486440 -0.752776    a  two
4  0.076775  0.662958    a  one
group b
      data1     data2 key1 key2
2  0.895821 -1.280097    b  one
3 -1.116129 -0.661318    b  two

In [32]:
df2 = pandas.DataFrame(
    numpy.random.randn(5, 5),
    columns=['a', 'b', 'c', 'd', 'e'],
    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis']
)

In [33]:
map_dict = {
    'a': 'red',
    'b': 'blue',
    'c': 'cobalt',
    'd': 'red',
    'e': 'blue',
    'f': 'gold' # 없는 key에 대해 해도 에러는 안 남. 그냥 무시됨
}

In [34]:
df2.groupby(map_dict, axis=1).sum()

            blue    cobalt       red
Joe     0.691119 -0.945292 -0.943186
Steve   1.876081 -0.972832  0.444491
Wes    -1.552416  0.089498 -0.011167
Jim     1.445496  1.838837 -0.939233
Travis  1.087737 -1.092301 -2.938313

In [35]:
df2

               a         b         c         d         e
Joe     0.071942 -0.228771 -0.945292 -1.015128  0.919890
Steve  -0.127750  1.053245 -0.972832  0.572241  0.822836
Wes     0.396594 -1.055028  0.089498 -0.407761 -0.497388
Jim    -0.928711  1.053379  1.838837 -0.010523  0.392117
Travis -1.716703 -0.591101 -1.092301 -1.221611  1.678839